app/controllers/penguins_controller.rb

    def index
        penguins = Penguin.all.includes(:user_groups)
---
SELECT "penguins".* FROM "penguins"

    def show
        render json: Penguin.find(params[:id])
---
SELECT "penguins".* FROM "penguins" WHERE "penguins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]